## **Business Understanding**

* The goal of this project is to analyse the sales and generate a report with factors to be considered to improve sales performance.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from dotenv import dotenv_values
import pyodbc
import warnings
warnings.filterwarnings('ignore')

In [12]:
login = dotenv_values('.env')

SERVER = login.get('servername')
USER = login.get('user')
PASS = login.get('password')
DBNAME = login.get('database_name')

connection = f"DRIVER={{ODBC Driver 18 for SQL Server}};SERVER={SERVER};DATABASE={DBNAME};UID={USER};PWD={PASS};MARS_Connection=yes;MinProtocolVersion=TLSv1.0;MaxProtocolVersion=TLSv1.2;"

In [13]:
# Connect to the database
conn = pyodbc.connect(connection)

In [4]:
# Read data from the database
query = "SELECT * FROM dbo.Sales_July_2019"

July = pd.read_sql_query(query, conn)

In [5]:
query = "SELECT * FROM dbo.Sales_August_2019"

August = pd.read_sql_query(query, conn)
August.head(3)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,236670.0,Wired Headphones,2.0,11.990000,2031-08-19 22:21:00,"359 Spruce St, Seattle, WA 98101"
1,236671.0,Bose SoundSport Headphones,1.0,99.989998,2015-08-19 15:11:00,"492 Ridge St, Dallas, TX 75001"
2,236672.0,iPhone,1.0,700.000000,2006-08-19 14:40:00,"149 7th St, Portland, OR 97035"

In [6]:
query = "SELECT * FROM dbo.Sales_September_2019"

September = pd.read_sql_query(query, conn)
September.head(3)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,248151.0,AA Batteries (4-pack),4.0,3.84,2017-09-19 14:44:00,"380 North St, Los Angeles, CA 90001"
1,248152.0,USB-C Charging Cable,2.0,11.95,2029-09-19 10:19:00,"511 8th St, Austin, TX 73301"
2,248153.0,USB-C Charging Cable,1.0,11.95,2016-09-19 17:48:00,"151 Johnson St, Los Angeles, CA 90001"

In [7]:
query = "SELECT * FROM dbo.Sales_October_2019"

October = pd.read_sql_query(query, conn)
October.head(3)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,259358.0,34in Ultrawide Monitor,1.0,379.98999,2028-10-19 10:56:00,"609 Cherry St, Dallas, TX 75001"
1,259359.0,27in 4K Gaming Monitor,1.0,389.98999,2028-10-19 17:26:00,"225 5th St, Los Angeles, CA 90001"
2,259360.0,AAA Batteries (4-pack),2.0,2.99000,2024-10-19 17:20:00,"967 12th St, New York City, NY 10001"

In [8]:
query = "SELECT * FROM dbo.Sales_November_2019"

November = pd.read_sql_query(query, conn)
November.head(3)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,278797.0,Wired Headphones,1.0,11.99,2021-11-19 09:54:00,"46 Park St, New York City, NY 10001"
1,278798.0,USB-C Charging Cable,2.0,11.95,2017-11-19 10:03:00,"962 Hickory St, Austin, TX 73301"
2,278799.0,Apple Airpods Headphones,1.0,150.00,2019-11-19 14:56:00,"464 Cherry St, Los Angeles, CA 90001"

In [14]:
query = "SELECT * FROM dbo.Sales_December_2019"

December = pd.read_sql_query(query, conn)
December.head(3)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,295665.0,Macbook Pro Laptop,1.0,1700.00,2030-12-19 00:01:00,"136 Church St, New York City, NY 10001"
1,295666.0,LG Washing Machine,1.0,600.00,2029-12-19 07:03:00,"562 2nd St, New York City, NY 10001"
2,295667.0,USB-C Charging Cable,1.0,11.95,2012-12-19 18:21:00,"277 Main St, New York City, NY 10001"

In [15]:
January = pd.read_csv("./Data/Sales_January_2019.csv")
January.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"

In [16]:
February = pd.read_csv("./Data/Sales_February_2019.csv")
February.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,150502,iPhone,1,700,02/18/19 01:35,"866 Spruce St, Portland, ME 04101"
1,150503,AA Batteries (4-pack),1,3.84,02/13/19 07:24,"18 13th St, San Francisco, CA 94016"
2,150504,27in 4K Gaming Monitor,1,389.99,02/18/19 09:46,"52 6th St, New York City, NY 10001"

In [17]:
March = pd.read_csv("./Data/Sales_March_2019.csv")
March.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,162009,iPhone,1,700,03/28/19 20:59,"942 Church St, Austin, TX 73301"
1,162009,Lightning Charging Cable,1,14.95,03/28/19 20:59,"942 Church St, Austin, TX 73301"
2,162009,Wired Headphones,2,11.99,03/28/19 20:59,"942 Church St, Austin, TX 73301"

In [18]:
April = pd.read_csv("./Data/Sales_April_2019.csv")
April.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"

In [19]:
May = pd.read_csv("./Data/Sales_May_2019.csv")
May.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,194095,Wired Headphones,1,11.99,05/16/19 17:14,"669 2nd St, New York City, NY 10001"
1,194096,AA Batteries (4-pack),1,3.84,05/19/19 14:43,"844 Walnut St, Dallas, TX 75001"
2,194097,27in FHD Monitor,1,149.99,05/24/19 11:36,"164 Madison St, New York City, NY 10001"

In [20]:
June = pd.read_csv("./Data/Sales_June_2019.csv")
June.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,209921,USB-C Charging Cable,1,11.95,06/23/19 19:34,"950 Walnut St, Portland, ME 04101"
1,209922,Macbook Pro Laptop,1,1700.0,06/30/19 10:05,"80 4th St, San Francisco, CA 94016"
2,209923,ThinkPad Laptop,1,999.99,06/24/19 20:18,"402 Jackson St, Los Angeles, CA 90001"

In [21]:
months =[January,February,March,April,May,June]
first_half = pd.concat(months)
first_half.head(1)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"

In [22]:
months2 =[July,August,September,October,November,December]
second_half = pd.concat(months2)
second_half.head(1)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,222910.0,Apple Airpods Headphones,1.0,150.0,2026-07-19 16:51:00,"389 South St, Atlanta, GA 30301"

In [31]:
# To rename columns before concatenation

first_half = first_half.rename(columns={
    'Order ID': 'Order_ID',
    'Quantity Ordered': 'Quantity_Ordered',
    'Price Each': 'Price_Each',
    'Order Date': 'Order_Date',
    'Purchase Address': 'Purchase_Address'
})

first_half.head(1)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"

In [70]:
year = [first_half, second_half]


df = pd.concat(year, axis=0)

df.head(3)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"

In [61]:
df.shape

(186850, 6)

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 186850 entries, 0 to 101224
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order_ID          186110 non-null  object
 1   Product           186305 non-null  object
 2   Quantity_Ordered  186110 non-null  object
 3   Price_Each        186110 non-null  object
 4   Order_Date        186110 non-null  object
 5   Purchase_Address  186305 non-null  object
dtypes: object(6)
memory usage: 10.0+ MB

In [58]:
df.isna().sum()

Order_ID            740
Product             545
Quantity_Ordered    740
Price_Each          740
Order_Date          740
Purchase_Address    545
dtype: int64

In [71]:
df = df.dropna(how='any',axis=0)

df.isna().sum()

Order_ID            0
Product             0
Quantity_Ordered    0
Price_Each          0
Order_Date          0
Purchase_Address    0
dtype: int64

In [65]:
df.shape

(186110, 6)

In [72]:
df.duplicated().sum()

423

In [81]:
duplicate_rows = df[df.duplicated()]
duplicate_rows

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
875,142071,AA Batteries (4-pack),1,3.84,01/17/19 23:02,"131 2nd St, Boston, MA 02215"
1102,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1194,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1897,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2463,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
...,...,...,...,...,...,...
96002,314675.0,AA Batteries (4-pack),1.0,3.84,2026-12-19 09:01:00,"927 13th St, San Francisco, CA 94016"
96560,315204.0,Wired Headphones,1.0,11.99,2012-12-19 12:41:00,"680 6th St, San Francisco, CA 94016"
97348,315955.0,ThinkPad Laptop,1.0,999.98999,2026-12-19 17:28:00,"588 Chestnut St, Seattle, WA 98101"
97575,316173.0,AAA Batteries (4-pack),1.0,2.99,2022-12-19 22:44:00,"907 Sunset St, Portland, OR 97035"
99460,317971.0,AA Batteries (4-pack),1.0,3.84,2017-12-19 18:39:00,"250 Chestnut St, San Francisco, CA 94016"

In [85]:
df = df.drop_duplicates(subset=None, keep='first',inplace=False)
df.shape

(185687, 6)